#### EXERCÍCIO 1

In [1]:
import pandas as pd

sales = pd.read_csv('sales1000.csv')
sales.head()

                         Region Country  ...  Total Cost Total Profit
0  Middle East and North Africa   Libya  ...  2224085.18   1468506.02
1                 North America  Canada  ...   274426.74    190526.34
2  Middle East and North Africa   Libya  ...   241840.14    145419.62
3                          Asia   Japan  ...   389039.42    294295.98
4            Sub-Saharan Africa    Chad  ...    68127.40     23726.45

[5 rows x 14 columns]

In [41]:
country = sales.groupby('Country')['Item Type'].nunique().reset_index()
country[country.Country == 'Japan']

   Country  Item Type
76   Japan          6

#### EXERCÍCIO 2

In [42]:
lucro = sales.groupby('Country')['Total Profit'].sum().sort_values(ascending = False).reset_index()
lucro

                            Country  Total Profit
0                              Cuba    7351820.83
1                  Papua New Guinea    6085514.28
2          Central African Republic    5338519.48
3                             Ghana    4736567.14
4                          Malaysia    4715338.84
..                              ...           ...
180                          Latvia     258775.02
181                      Kazakhstan     254529.12
182  Federated States of Micronesia     147867.28
183                         Denmark      86083.02
184                        Cameroon      34407.36

[185 rows x 2 columns]

#### EXERCÍCIO 3

In [39]:
country_m7 = sales.groupby('Country')['Item Type'].nunique().reset_index()
country_m7[country_m7['Item Type'] > 7]

    Country  Item Type
13  Belarus          8
35     Cuba          8

#### EXERCÍCIO 4

In [59]:
max_min = sales.groupby('Country')['Units Sold'].apply(lambda x: (x.max()-x.min())).sort_values(ascending=False).to_frame('Diff [MAX-MIN]').reset_index()
print(max_min)

Country  Diff [MAX-MIN]
0    Cape Verde            9775
1       Finland            9712
2       Belgium            9682
3          Chad            9651
4         Japan            9640
..          ...             ...
180      Kuwait             714
181       Nauru             459
182      Kosovo               0
183       Malta               0
184    Cameroon               0

[185 rows x 2 columns]

#### EXERCÍCIO 5

In [57]:
meanProfit = sales.groupby('Item Type').apply(lambda x: (x['Unit Price'].sum()-x['Unit Cost'].sum())).sort_values(ascending=False).to_frame('LUCRO MEDIO').reset_index()
print(meanProfit)

Item Type  LUCRO MEDIO
0         Cosmetics     13040.25
1         Household     12761.21
2   Office Supplies     11236.25
3         Baby Food      8339.82
4            Cereal      6998.61
5        Vegetables      6123.61
6           Clothes      5728.32
7            Snacks      4521.48
8              Meat      4461.60
9     Personal Care      2180.22
10        Beverages      1581.66
11           Fruits       168.70